<script setup lang="ts"></script>

<template>
  <section class="bg-[#FFFBFC] text-black py-[50px] block max-md:hidden">
    <div class="mx-[50px] flex flex-col gap-[60px]">
      <div class="flex justify-between items-start">
        <div class="flex flex-row justify-between w-full max-2xl:flex-col max-2xl:gap-[30px]">
          <h1
            class="text-6xl font-normal leading-snug items-start max-2xl:text-4xl max-2xl:text-center"
          >
            Сочи Ремонт - Ваш<br class="max-2xl:hidden" />
            эксперт в мире ремонта
          </h1>
          <div class="flex flex-col gap-4 max-w-[910px] max-2xl:text-center max-2xl:mx-auto">
            <p class="text-lg">Сочи Ремонт - Профессиональный ремонт квартир в Сочи</p>
            <p class="text-lg mt-4">
              Сочи Ремонт предлагает комплексные решения для ремонта и отделки квартир в Сочи.
              Капитальный ремонт, дорогой интерьер, работа под ключ. Узнайте о наших ценах и
              качестве услуг!
            </p>
            <p class="text-lg mt-4">
              Ремонт квартир в Сочи, капитальный ремонт сочи, дорогой ремонт сочи, ремонт под ключ
              сочи, отделка квартир в сочи
            </p>
          </div>
        </div>
      </div>
      <div class="grid grid-cols-4 gap-[95px] max-2xl:grid-cols-2">
        <div class="flex flex-col gap-[30px]">
          <h2 class="text-2xl font-normal mb-[30px]">О компании</h2>
          <p>
            Компания "Сочи Ремонт" с гордостью представляет широкий спектр ремонтных и отделочных
            услуг в Сочи с 2015 года. Наша миссия — превращать ваше жилище в место счастья с помощью
            инновационных решений и безупречного качества работы.
          </p>
          <p>
            Мы специализируемся на ремонте квартир в Сочи, предлагая услуги от косметического до
            капитального ремонта. Благодаря глубоким знаниям местного рынка и опыту, наша команда
            гарантирует выполнение проектов любой сложности на высшем уровне.
          </p>
          <h2 class="text-2xl font-normal mb-[30px] mt-[50px]">Отзывы клиентов</h2>
          <p>
            Мы ценим каждого нашего клиента и стремимся к тому, чтобы каждый проект был выполнен
            идеально. В разделе <span class="font-bold">отзывы о ремонте в Сочи</span>, вы можете
            узнать мнения людей, которые уже воспользовались нашими услугами. Их положительные
            отклики — лучшее подтверждение нашего качества и профессионализма.
          </p>
        </div>
        <div class="flex flex-col gap-[30px]">
          <h2 class="text-2xl font-normal mb-[30px]">Наши услуги</h2>
          <p>Мы предлагаем широкий спектр услуг, включая:</p>
          <ul class="flex flex-col gap-4">
            <li class="flex items-start gap-3">
              <img src="/BlackRomb.svg" alt="Маркер" class="mt-1.5" width="12" height="12" />
              <div>
                <h3 class="font-medium">Капитальный ремонт квартир в Сочи:</h3>
                <p>
                  Полное преобразование вашего пространства с заменой всех инженерных систем и
                  конструктивных элементов.
                </p>
              </div>
            </li>
            <li class="flex items-start gap-3">
              <img src="/BlackRomb.svg" alt="Маркер" class="mt-1.5" width="12" height="12" />
              <div>
                <h3 class="font-medium">Дорогой ремонт в Сочи:</h3>
                <p>
                  Эксклюзивные дизайнерские решения и использование премиум материалов для создания
                  уникальных интерьеров.
                </p>
              </div>
            </li>
            <li class="flex items-start gap-3">
              <img src="/BlackRomb.svg" alt="Маркер" class="mt-1.5" width="12" height="12" />
              <div>
                <h3 class="font-medium">Ремонт квартир в Сочи под ключ:</h3>
                <p>
                  От начального проекта до последних штрихов — полный спектр работ под одним крылом
                  "Сочи Ремонт".
                </p>
              </div>
            </li>
            <li class="flex items-start gap-3">
              <img src="/BlackRomb.svg" alt="Маркер" class="mt-1.5" width="12" height="12" />
              <div>
                <h3 class="font-medium">Отделка квартир в Сочи:</h3>
                <p>
                  Выполнение всех видов отделочных работ, включая малярные, плиточные и другие виды
                  работ.
                </p>
              </div>
            </li>
            <li class="flex items-start gap-3">
              <img src="/BlackRomb.svg" alt="Маркер" class="mt-1.5" width="12" height="12" />
              <div>
                <h3 class="font-medium">Ремонт квартир в новостройке Сочи:</h3>
                <p>
                  Адаптация и улучшение квартир в новых жилых комплексах по индивидуальным проектам.
                </p>
              </div>
            </li>
          </ul>
          <p>
            Каждая услуга реализуется с учетом индивидуальных пожеланий клиентов и с применением
            самых современных и качественных материалов.
          </p>
        </div>
        <div class="flex flex-col gap-[30px]">
          <h2 class="text-2xl font-normal mb-[30px]">Цены на ремонт в Сочи</h2>
          <p>
            В "Сочи Ремонт" вы найдете прозрачную и честную ценовую политику. Мы предлагаем «strong»
            ремонт квартир в Сочи по адекватным ценам! «/strong» - оптимизированный под каждый
            конкретный проект. Наши предложения помогут вам выбрать оптимальный вариант ремонта в
            зависимости от ваших нужд и бюджета.
          </p>
          <p class="mt-4">
            Для более детальной информации о ценах, пожалуйста, посетите нашу страницу "Цены" или
            свяжитесь с нами для получения персонализированной сметы.
          </p>
        </div>
        <div class="flex flex-col gap-[30px]">
          <h2 class="text-2xl font-normal mb-[30px]">Контакты</h2>
          <p>
            Если у вас возникли вопросы или вы хотите обсудить ваш проект ремонта, наша команда
            всегда к вашим услугам! Мы доступны для консультаций и готовы начать работу над вашим
            проектом в удобное для вас время.
          </p>
        </div>
      </div>
    </div>
  </section>

  <section class="hidden max-md:block bg-[#FFFBFC] text-black min-h-screen py-8 px-4">
    <div class="flex flex-col gap-[60px] justify-center items-center">
      <div class="flex flex-col gap-[30px] items-center">
        <h2 class="text-2xl font-normal">О компании "Сочи Ремонт"</h2>
        <p class="text-[#848386] text-sm">
          Добро пожаловать в "Сочи Ремонт" — вашего надежного проводника в мире ремонтных услуг. За
          годы работы наша компания зарекомендовала себя как один из лидеров в области ремонта
          однокомнатных квартир в Сочи. Наша миссия — предоставлять высококачественные ремонтные
          работы, которые сочетают в себе надежность, стиль и доступность.
        </p>
      </div>
      <div class="flex flex-col gap-[30px] items-center">
        <h2 class="text-2xl font-normal">Наша История</h2>
        <p class="text-black text-sm">
          "Сочи Ремонт" была основана в 2015 году группой энтузиастов-строителей с общим видением
          изменения рынка ремонтных услуг. С тех пор мы росли и развивались, с каждым годом расширяя
          спектр наших услуг и улучшая качество работы.
        </p>
      </div>
      <div class="flex flex-col gap-[30px] items-center">
        <h2 class="text-2xl font-normal">Наши Ценности</h2>
        <p class="text-black text-sm">
          Мы верим в важность каждой детали и стремимся к тому, чтобы каждый проект был выполнен
          безупречно. Уважение к клиентам, ответственность за результат и стремление к инновациям —
          вот основы, на которых строится наша корпоративная культура.
        </p>
      </div>
      <div class="flex flex-col gap-[30px] items-center">
        <h2 class="text-2xl font-normal">Наша Команда</h2>
        <p class="text-black text-sm">
          Команда "Сочи Ремонт" состоит из высококвалифицированных специалистов, которые постоянно
          повышают свою квалификацию и следят за новейшими тенденциями в области ремонтных и
          отделочных работ. Мы гордимся каждым мастером, инженером и дизайнером, работающим у нас.
        </p>
      </div>
      <div class="flex flex-col gap-[30px] items-center">
        <h2 class="text-2xl font-normal">Наши Достижения</h2>
        <p class="text-black text-sm">
          За годы работы мы получили множество наград за качество наших услуг и уровень
          удовлетворенности клиентов. Мы регулярно занимаем высокие места в рейтингах строительных и
          ремонтных компаний Сочи.
        </p>
      </div>
      <div class="flex flex-col gap-[30px] items-center">
        <h2 class="text-2xl font-normal">Отзывы Клиентов</h2>
        <p class="text-black text-sm">
          Мнения наших клиентов — лучшее подтверждение нашего профессионализма. На нашем сайте вы
          можете ознакомиться с отзывами людей, которые уже воспользовались нашими услугами и
          остались довольны результатом.
        </p>
      </div>
      <div class="flex flex-col gap-[30px] items-center">
        <h2 class="text-2xl font-normal">Присоединяйтесь к нам</h2>
        <p class="text-black text-sm">
          Наши двери всегда открыты для новых проектов. Если вы ищете надежного партнера по ремонту
          в Сочи, "Сочи Ремонт" готова предложить вам лучшее решение. Свяжитесь с нами сегодня,
          чтобы обсудить ваш проект!
        </p>
      </div>
      <div class="flex flex-col gap-[30px]">
        <h2 class="text-2xl font-normal text-center">Контакты</h2>
        <ul class="text-black text-sm flex flex-col gap-2">
          <li class="flex items-center gap-2">
            <span class="inline-block w-2 h-2 rounded-full bg-[#848386]"></span>
            Телефон: [Вставьте номер телефона]
          </li>
          <li class="flex items-center gap-2">
            <span class="inline-block w-2 h-2 rounded-full bg-[#848386]"></span>
            Электронная почта: [Вставьте адрес электронной почты]
          </li>
          <li class="flex items-center gap-2">
            <span class="inline-block w-2 h-2 rounded-full bg-[#848386]"></span>
            Форма обратной связи на сайте
          </li>
        </ul>
        <p>
          Приглашаем вас узнать больше о наших услугах и проектах, просмотреть галерею наших работ и
          начать ваш следующий ремонтный проект с "Сочи Ремонт"!
        </p>
      </div>
      <div class="flex flex-col gap-[30px] ">
        <h2 class="text-2xl font-normal text-center">Визуализация нашего мастерства</h2>
        <p class="text-black text-sm">
          Просмотрите нашу фотогалерею выполненных проектов и убедитесь в высоком уровне мастерства
          наших специалистов. Каждое изображение говорит о том, что мы ставим сердце в каждую деталь
          вашего будущего комфорта.
        </p>
        <p class="text-black text-sm">
          Мы гордимся тем, что делаем, и стремимся делать ваш мир лучше!
        </p>
      </div>
    </div>
  </section>
</template>
