<template>
  <section class="bg-white py-16 max-sm:hidden">
    <div class="w-full h-[1px] bg-[#000000] opacity-10 mt-[70px] mb-[60px]"></div>
    <div class="container mx-auto px-4 flex flex-col gap-[120px]">
      <div class="flex flex-row justify-between items-center max-2xl:flex-col max-2xl:gap-[30px]">
        <h2 class="text-4xl font-bold mb-8 text-[#3C332D]">Услуги ремонта<br class="max-2xl:hidden"/> в Сочи</h2>
        <p class="text-lg text-[#000000] max-w-[910px]">
          Современные тенденции в строительстве и дизайне интерьера в Сочи развиваются стремительно.
          Когда дело доходит до ремонта квартир и создания дизайн-проектов, важно найти надежного
          партнера, который предоставит высококачественные услуги по ремонту квартир, учтет
          стоимость услуг ремонта, а также сможет реализовать ваше видение идеального интерьера.
          <br />Компания "Сочи-ремонт" гордится предоставлением всего спектра услуг в сфере
          строительства, ремонта и дизайна интерьера, а также разработки дизайн-проектов квартир
        </p>
      </div>

      <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-4 gap-8">
        <div>
          <h3 class="text-3xl font-semibold mb-2 text-[#3C332D]">Высокое качество ремонта</h3>
          <p class="text-lg text-[#40362E]">
            Оказание услуг по ремонту квартир – одна из ключевых областей деятельности
            "Сочи-ремонт". Мы глубоко знаем местные нюансы и специфику строительных работ. Наши
            специалисты имеют обширный опыт и профессиональные навыки, чтобы справиться с ремонтом
            любой сложности.<br /><br />Мы используем только высококлассные материалы и современное
            оборудование, чтобы каждый проект был завершён с учетом самых высоких стандартов.
          </p>
        </div>
        <div>
          <h3 class="text-3xl font-semibold mb-2 text-[#3C332D]">
            Понятная стоимость услуг ремонта
          </h3>
          <p class="text-lg text-[#40362E]">
            Мы понимаем, что прозрачность в финансовых вопросах очень важна для наших клиентов.
            Поэтому "Сочи-ремонт" предоставляет подробные сметы и обсуждает стоимость ремонта
            заранее. Мы гарантируем отсутствие скрытых затрат или неприятных сюрпризов.<br /><br />Мы
            предлагаем честные и конкурентоспособные цены, которые соответствуют качеству наших
            услуг.
          </p>
        </div>
        <div>
          <h3 class="text-3xl font-semibold mb-2 text-[#3C332D]">Индивидуальный дизайн интерьера</h3>
          <p class="text-lg text-[#40362E]">
            Мы также предоставляем услуги дизайна интерьера. Наша команда профессионалов и опытных
            дизайнеров поможет воплотить ваши идеи в реальность.<br /><br />Мы работаем над
            созданием уникальных проектов с учетом ваших пожеланий, чтобы результат превзошёл
            ожидания.
          </p>
        </div>
        <div>
          <h3 class="text-3xl font-semibold mb-2 text-[#3C332D]">Услуги дизайн-проекта квартиры</h3>
          <p class="text-lg text-[#40362E]">
            Наши услуги включают в себя не только ремонтные работы, но и разработку дизайн-проектов
            квартир. Это позволяет заранее визуализировать будущий интерьер, подобрать материалы,
            мебель и аксессуары, которые идеально впишутся в ваш дом.<br /><br />Мы уделяем внимание
            каждой детали, чтобы итоговый результат был идеально согласованным.
          </p>
        </div>
      </div>
    </div>
    <div class="w-full flex justify-end container mx-auto px-4 mt-[60px]">
      <p class="max-w-[795px] text-black opacity-40">
        Выбрав компанию "Сочи-ремонт" для ремонта и дизайна вашей квартиры, вы получите выдающееся
        качество услуг, прозрачную стоимость и надежного партнера на каждом этапе проекта. Наши
        специалисты всегда готовы ответить на ваши вопросы и предложить лучшие решения. Мы работаем
        с любыми бюджетами и всегда гарантируем отличные результаты.
      </p>
    </div>
     
    <div class="w-full h-[1px] bg-[#000000] opacity-10 mt-[60px]"></div>
  </section>
</template>
